# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO17: StarNet-style C2fStar (PW_gate split + star op). uib_e converted so that
# PW FLOPs (3·e·c²) stay within the original budget (was 2·e_old·c²), freeing headroom
# to deepen P4/P5 where per-class gaps vs yolo26n concentrate (racket/backpack/handbag).
# mgs=4 enables mild cross-channel spatial mixing in RepDW.

# Parameters
nc: 80 # number of classes
end2end: False # NMS post-processing
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fStar, [256, 0.25, False, True, 4.0, 5, 4]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fStar, [512, 0.25, False, True, 2.5, 5, 4]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, C2fStar, [512, 0.5, False, True, 1.25, 5, 4]] # 6  (depth ↑ 2→4: spend headroom on P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, C2fStar, [1024, 0.5, False, True, 1.25, 7, 4]] # 8 (depth ↑ 2→4: larger RF on P5)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2fStar, [512, 0.5, False, True, 1.25, 5, 4]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2fStar, [256, 0.5, False, True, 1.25, 7, 4]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2fStar, [512, 0.5, False, True, 1.25, 5, 4]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fStar, [1024, 0.5, True, True, 1.25, 7, 4]] # 22

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
