# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license
#
# YOLO40: head-weakening rebalance vs yolo39.
# Changes vs yolo39:
#   - Head C2fStar depth: n=4 -> n=2 (all 4 head blocks) -> -12 layers (131->119)
#   - Backbone uib_e: P3 4.0 -> 5.0, P4 2.5 -> 4.0, P5 2.5 -> 4.0
#   - Everything else identical to yolo39.
#
# Probe: 2.44M params, 5.34 GFLOPs, 119 layers. Budget-fit vs yolo26n (2.41M, 5.36, 120).
# TRT FP16 (RTX 4090, random weights): 1.260 ms -- 17.2% faster than yolo26n.
#
# C2fStar args: [c2, e, attn, shortcut, uib_e, dw_k]

# Parameters
nc: 80
end2end: False
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fStar, [256, 0.25, False, True, 6.0, 5]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fStar, [512, 0.25, False, True, 5.0, 5]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, C2fStar, [512, 0.5, False, True, 4.0, 5]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, C2fStar, [1024, 0.5, False, True, 4.0, 7]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, C2fStar, [512, 0.5, False, True, 2.0, 5]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C2fStar, [256, 0.5, False, True, 2.0, 7]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C2fStar, [512, 0.5, False, True, 2.0, 5]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C2fStar, [1024, 0.5, True, True, 2.0, 7]] # 22

  - [[16, 19, 22], 1, Detect, [nc]]
