# Ultralytics AGPL-3.0 License - https://ultralytics.com/license

# YOLO18: YOLO17 hybrid -- C2fUIB backbone/head + C3k2 at strategic dense positions
# UIBottleneck (Star+SE+RepDW7x7+LayerScale) for efficient spatial extraction
# C3k2 (dense 3x3) at backbone P5 and P5->P4 fusion for cross-channel integration
#
# Key insight: after Concat, DW conv processes channels from two streams in isolation.
# Dense 3x3 at fusion immediately creates joint spatial x channel features.
#
# vs YOLO26 budget:  n=6.0/6.1  s=22.3/22.8  m=68.3/75.4  l=92.0/93.8  x=204.2/209.5

# Parameters
nc: 80 # number of classes
end2end: False # NMS post-processing
reg_max: 1 # DFL bins
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO18 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2fUIB, [256, 0.25, False, True, 2.0, 5]] # 2-P2 features
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 5, C2fUIB, [512, 0.25, False, True, 2.0, 5]] # 4-P3 features (deep)
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 5, C2fUIB, [512]] # 6-P4 features (deep)
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3k2, [1024, True]] # 8-P5 features (dense)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 3, C2PSA, [1024]] # 10

# YOLO18 head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, True]] # 13 (dense cross-stream fusion)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 5, C2fUIB, [256, 0.5, False, True, 2.0, 5]] # 16 (P3/8-small, deep)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fUIB, [512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fUIB, [1024, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
