# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO38: yolo17 (combo) scaled UP to match yolo26n GFLOPs budget (~5.4).
# Combo: γ_init=1.0 + dilated rep + SE on every 2nd StarBottleneck.
# Depth bump: P4/P5 backbone 2->4, all head C2fStar 2->4 (bottom-up P5 stays 1->2).
#
# Rationale:
#   1) Match yolo26n compute envelope (5.4 GFLOPs, 2.41M params) for fair comparison.
#   2) At scale=n (depth=0.5), n=2 in YAML rounds to actual_n=1 -> SE NEVER activates
#      (SE is enabled on every 2nd block: idx=1, 3, ...). Bumping to n=4 yields
#      actual_n=2, so SE runs on idx=1 of each stage. Critical fix vs yolo17 combo run.
#   3) Depth expansion on P4/P5 addresses Hard-COCO weak classes
#      (book/knife/handbag/backpack) which need more capacity on mid/high-level features.

# Parameters
nc: 80 # number of classes
end2end: False # NMS post-processing
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# C2fStar args: [c2, e, attn, shortcut, uib_e, dw_k]
# (use_se=True, use_dilated_rep=True, se_stride=2 via C2fStar defaults)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fStar, [256, 0.25, False, True, 6.0, 5]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fStar, [512, 0.25, False, True, 4.0, 5]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 4, C2fStar, [512, 0.5, False, True, 2.0, 5]] # 6   (depth 2->4: SE activates)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 4, C2fStar, [1024, 0.5, False, True, 2.0, 7]] # 8  (depth 2->4: SE activates)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 4, C2fStar, [512, 0.5, False, True, 2.0, 5]] # 13  (depth 2->4: SE activates)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 4, C2fStar, [256, 0.5, False, True, 2.0, 7]] # 16  (depth 2->4: SE activates)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 4, C2fStar, [512, 0.5, False, True, 2.0, 5]] # 19  (depth 2->4: SE activates)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 2, C2fStar, [1024, 0.5, True, True, 2.0, 7]] # 22  (depth 1->2: SE activates, attn=True)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
