# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO34: RepC2f-PConv backbone/neck.
#   Bottleneck: PConv3x3(c/4) -> RepDW(3,5,id) -> PW -> gamma*out + residual, gamma_init=1.0.
#   EMA attention enabled only on the deepest P5 head layer (cheapest placement,
#   highest-level semantics). Additional EMA placements hurt CPU latency far more
#   than their FLOPs cost suggests.
#   Budget target: <= yolo26n (2.41M params, 5.36 GFLOPs fused).
#
# C2fRepPConv args: [c2, e, attn, shortcut, n_div, dw_k]

# Parameters
nc: 80
end2end: False
reg_max: 1
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fRepPConv, [256, 0.5, False, True, 4, 5]] # 2   (e 0.25->0.5)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fRepPConv, [512, 0.5, False, True, 4, 5]] # 4   (e 0.25->0.5)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2fRepPConv, [512, 0.5, False, True, 4, 5]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2fRepPConv, [1024, 0.5, False, True, 4, 7]] # 8  larger RF on P5
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2fRepPConv, [512, 0.5, False, True, 4, 5]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2fRepPConv, [256, 0.5, False, True, 4, 5]] # 16

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2fRepPConv, [512, 0.5, False, True, 4, 5]] # 19

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fRepPConv, [1024, 0.5, True, True, 4, 7]] # 22  single EMA on deepest head

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
