# YOLO26 with DINOv3 ConvNeXt-Tiny backbone
nc: 80
end2end: True
reg_max: 1
scales:
  t: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, DINOv3ConvNeXt, ["tiny", False, True]]  # dims 96/192/384/768
  - [-1, 1, Index, [192, 0]]
  - [-2, 1, Index, [384, 1]]
  - [-3, 1, Index, [768, 2]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]
  - [[11, 14, 17], 1, Detect, [nc]]
