# YOLO26 with DINOv3 ConvNeXt-Base backbone
nc: 80
end2end: True
reg_max: 1
scales:
  b: [0.50, 1.00, 1024]

backbone:
  - [-1, 1, DINOv3ConvNeXt, ["base", False, True]]  # dims 128/256/512/1024
  - [-1, 1, Index, [256, 0]]
  - [-2, 1, Index, [512, 1]]
  - [-3, 1, Index, [1024, 2]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 1, C3k2, [1024, True, 0.5, True]]
  - [[11, 14, 17], 1, Detect, [nc]]
