# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv9s GELAN head with DINOv3 ConvNeXt backbone (P3/8 - P5/32 outputs)
# Backbone is fully frozen; only neck/head are trained.

# Parameters
nc: 80 # number of classes
end2end: False
scales:
  # [depth, width, max_channels] -- applied only to neck/head
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# DINOv3 ConvNeXt backbone (tiny -> 192 / 384 / 768 channels at P3/P4/P5).
# Switch variant by pointing ``weights`` at another official .pth checkpoint.
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv3ConvNeXt, ["dinov3_convnext_tiny_pretrain_lvd1689m-21b726bb.pth", True, True, [1, 2, 3]]] # 0: (P3, P4, P5)
  - [-1, 1, Index, [192, 0]]    # 1: P3/8   192 ch
  - [-2, 1, Index, [384, 1]]    # 2: P4/16  384 ch
  - [-3, 1, Index, [768, 2]]    # 3: P5/32  768 ch
  - [-1, 1, SPPELAN, [256, 128]] # 4

# GELAN head (from YOLOv9s)
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]                  # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]   # 7

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]                  # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]]   # 10 (P3/8-small)

  - [-1, 1, AConv, [96]]
  - [[-1, 7], 1, Concat, [1]]                  # cat head P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]]   # 13 (P4/16-medium)

  - [-1, 1, AConv, [128]]
  - [[-1, 4], 1, Concat, [1]]                  # cat head P5
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]]  # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]]            # Detect(P3, P4, P5)
