# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO26 with DINOv3 ConvNeXt backbone (P2/4 - P5/32 outputs)
# Adds an extra P2/4 detection level for better small-object AP on COCO.
# Backbone is fully frozen; only neck/head are trained.

# Parameters
nc: 80
end2end: False
reg_max: 1
scales:
  # [depth, width, max_channels] -- applied only to neck/head
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Channel sizes emitted by the DINOv3 ConvNeXt backbone at P2/P3/P4/P5.
# The variant (tiny/small/base/large) is inferred from the checkpoint file --
# point ``weights`` at a different official .pth to switch backbones.

backbone:
  # [from, repeats, module, args]
  - [-1, 1, DINOv3ConvNeXt, ["dinov3_convnext_tiny_pretrain_lvd1689m-21b726bb.pth", True, True, [0, 1, 2, 3]]]  # 0: (P2, P3, P4, P5)
  - [-1, 1, Index, [96, 0]]                          # 1: P2/4    96 ch
  - [-2, 1, Index, [192, 1]]                         # 2: P3/8   192 ch
  - [-3, 1, Index, [384, 2]]                         # 3: P4/16  384 ch
  - [-4, 1, Index, [768, 3]]                         # 4: P5/32  768 ch
  - [-1, 1, SPPF, [1024, 5, 3, True]]                # 5
  - [-1, 2, C2PSA, [1024]]                           # 6

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]                         # cat backbone P4
  - [-1, 2, C3k2, [512, True]]                        # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]]                         # cat backbone P3
  - [-1, 2, C3k2, [256, True]]                        # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 1], 1, Concat, [1]]                         # cat backbone P2
  - [-1, 2, C3k2, [128, True]]                        # 15 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]                        # cat head P3
  - [-1, 2, C3k2, [256, True]]                        # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]                         # cat head P4
  - [-1, 2, C3k2, [512, True]]                        # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 6], 1, Concat, [1]]                         # cat head P5
  - [-1, 1, C3k2, [1024, True, 0.5, True]]            # 24 (P5/32-large)

  - [[15, 18, 21, 24], 1, Detect, [nc]]               # Detect(P2, P3, P4, P5)
