# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO16 INT8-friendly object detection model with P3/8 - P5/32 outputs
# Same as yolo16.yaml but with C2PSAFL (Focused Linear Attention) instead of C2PSA
# All ops INT8-quantizable: no softmax/sigmoid, only Conv + ReLU + MatMul

# Parameters
nc: 80 # number of classes
end2end: False # NMS post-processing
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo16n-int8.yaml' will call yolo16-int8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO16n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fUIB, [256, 0.25, False, True, 2.0, 5]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fUIB, [512, 0.25, False, True, 2.0, 5]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2fUIB, [512]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2fUIB, [1024]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSAFL, [1024]] # 10 — INT8-friendly focused linear attention

# YOLO16n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2fUIB, [512]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2fUIB, [256, 0.5, False, True, 2.0, 5]] # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2fUIB, [512]] # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fUIB, [1024, 0.5, True]] # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
