# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO16-fast: TensorRT-optimized variant
# Changes vs yolo16.yaml:
#   - Head P4 (layers 13, 19): ECA off, dw_k 7→5  (LOW risk — medium objects have strong signal)
#   - Head P3 (layer 16):      ECA KEPT, dw_k KEPT (protects AP_small for occluded objects)
#   - Backbone P4 (layer 6):   ECA off, dw_k 7→5  (LOW risk — head refines further)
#   - Everything else:         unchanged

# Parameters
nc: 80 # number of classes
end2end: False # NMS post-processing
reg_max: 1 # DFL bins
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO16-fast backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C2fStar, [256, 0.25, False, True, 2.0, 5, False]] # 2  (unchanged)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C2fStar, [512, 0.25, False, True, 2.0, 5, True]] # 4   (unchanged — P3bb ECA protects small obj)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C2fStar, [512, 0.5, False, True, 2.0, 5, False]] # 6   ← dw_k 7→5, ECA off (was 7, True)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C2fStar, [1024, 0.5, False, True, 2.0, 7, False]] # 8  (unchanged)
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO16-fast head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C2fStar, [512, 0.5, False, True, 2.0, 5, False]] # 13  ← dw_k 7→5, ECA off (P4 head)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C2fStar, [256, 0.5, False, True, 2.0, 7, True]] # 16   (UNCHANGED — protects AP_small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C2fStar, [512, 0.5, False, True, 2.0, 5, False]] # 19  ← dw_k 7→5, ECA off (P4 head)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C2fStar, [1024, 0.5, True, True, 2.0, 7, False]] # 22  (unchanged)

  - [[16, 19, 22], 1, Detect, [nc]] # Detect(P3, P4, P5)
